Public Attributes | List of all members
API_NewProjectPars Struct Reference
Project Operations
Parameters to open a new project. More...
#include <APIdefs_Automate.h>
 Public Attributes
bool  | newAndReset
Performs New and Reset or just a simple New command.
bool  | enableSaveAlert
Show the "Save the current document before closing" alert or automatically save it before closing.
Detailed Description
Parameters to open a new project.
Remarks
For the utilization of this structure, see the ACAPI_ProjectOperation_NewProject automation function.
Member Data Documentation
◆ enableSaveAlert
 API_NewProjectPars::enableSaveAlert
Show the "Save the current document before closing" alert or automatically save it before closing.
◆ newAndReset
 API_NewProjectPars::newAndReset
Performs New and Reset or just a simple New command.